{"keras_version": "2.1.5-tf", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "batch_input_shape": [null, 1024, 64, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "name": "conv2d_4", "filters": 16, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [2, 2], "activation": "relu_advanced", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "name": "conv2d_5", "filters": 32, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [2, 2], "activation": "relu_advanced", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "name": "conv2d_6", "filters": 64, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [2, 2], "activation": "relu_advanced", "kernel_regularizer": null}}, {"class_name": "Conv2DTranspose", "config": {"padding": "same", "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "name": "conv2d_transpose_4", "filters": 32, "dtype": "float32", "activity_regularizer": null, "strides": [2, 2], "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "seed": null, "dtype": "float32", "noise_shape": null, "rate": 0.5}}, {"class_name": "Conv2DTranspose", "config": {"padding": "same", "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "name": "conv2d_transpose_5", "filters": 16, "dtype": "float32", "activity_regularizer": null, "strides": [2, 2], "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Conv2DTranspose", "config": {"padding": "same", "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "name": "conv2d_transpose_6", "filters": 1, "dtype": "float32", "activity_regularizer": null, "strides": [2, 2], "activation": "sigmoid", "kernel_regularizer": null}}]}